import React, { useState } from "react";
import { useNavigate } from "react-router-dom";

const TermsOfUse: React.FC = () => {
  const [checked, setChecked] = useState(false);
  const navigate = useNavigate();

  const handleCheckboxChange = (event: React.ChangeEvent<HTMLInputElement>) => {
    setChecked(event.target.checked);
  };

  const handleSubmit = (event: React.FormEvent<HTMLFormElement>) => {
    event.preventDefault();
    if (checked) {
      navigate(-1);
    } else {
      alert("אנא אשר את תנאי השימוש כדי להמשיך.");
    }
  };

  return (
    <div
      className="max-w-5xl w-full mx-auto mt-10 p-6 bg-white rounded-lg shadow"
      dir="rtl"
    >
      <h2 className="text-2xl font-bold mb-4 text-gray-800 text-center">
        תנאי שימוש
      </h2>
      <div className="border p-4 mb-4 bg-gray-50" dir="rtl">
        <p className="text-gray-600">
          ברוכים הבאים לפורטל הדיגיטלי של בלנדר, המנוהל על ידי עמותת בלנדר ומציע
          שירותי לימוד ערבית. השימוש באתר מותנה בקבלת כל התנאים המפורטים כאן. אם
          אינך מסכים לתנאים, יש להפסיק להשתמש באתר מיד.
        </p>
        <hr className="border-t-2 border-gray-500 w-full mx-auto my-4" />

        {/* 1. הקדמה */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">1. הקדמה</h3>
          <p>
            1.1 בלנדר מציעה שירותים בתחום לימוד השפה הערבית, כולל קורסים
            מקוונים, סדנאות, תכנים נוספים ומשאבים לימודיים, בהתאם לצרכים האישיים
            של כל משתמש.
          </p>
          <p>
            1.2 תנאי השימוש הללו חלים על כל המשתמשים באתר, לרבות גולשים רשומים
            או לא רשומים, ומכסים את השימוש בכל השירותים והתכנים המוצעים באתר.
          </p>
        </section>

        {/* 2. שימוש בשירותים */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">2. שימוש בשירותים</h3>
          <p>
            2.1 כל התכנים והשירותים המוצעים באתר מיועדים לשימוש אישי ובלתי מסחרי
            בלבד.
          </p>
          <p>
            2.2 אין להעתיק, לשכפל, להפיץ, לשנות, להציג, או לעשות שימוש כלשהו
            בתכנים מתוך האתר או השירותים לצרכים מסחריים ללא קבלת אישור בכתב מראש
            מהעמותה.
          </p>
          <p>
            2.3 המשתמש מתחייב להימנע מכל פעולה העלולה לפגוע בזכויות הקניין
            הרוחני של העמותה, לרבות זכויות יוצרים, סימני מסחר וזכויות קניין
            רוחני אחרות הקשורות בתכנים ובשירותים המוצעים באתר.
          </p>
        </section>

        {/* 3. הסרת אחריות */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">3. הסרת אחריות</h3>
          <p>
            3.1 העמותה עושה כל שביכולתה להבטיח שהתכנים המוצעים באתר יהיו
            מדויקים, עדכניים ומועילים. עם זאת, העמותה לא תהיה אחראית לשגיאות,
            אי-דיוקים, או חוסרים בתכנים, ואין היא אחראית לכל נזק ישיר או עקיף
            שייגרם למשתמש כתוצאה מהשימוש בשירותים או בתכנים.
          </p>
          <p>
            3.2 השימוש באתר ובשירותים נעשה על אחריות המשתמש בלבד. המשתמש מבין
            ומסכים כי העמותה אינה אחראית לכל נזק שייגרם כתוצאה משימוש בתכנים
            ו/או מכל פעילות הנעשית באתר.
          </p>
        </section>

        {/* 4. שינויים והסרת תכנים */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">4. שינויים והסרת תכנים</h3>
          <p>
            4.1 העמותה שומרת לעצמה את הזכות לעדכן, לשנות או להסיר תכנים מהאתר
            בכל עת, ללא הודעה מראש למשתמשים.
          </p>
          <p>
            4.2 המשתמש מסכים לשינויים ולתוספות שיבוצעו בתכנים או בשירותים
            המוצעים, והעמותה לא תהיה אחראית לכל נזק שייגרם למשתמש כתוצאה
            משינויים אלו.
          </p>
          <p>
            4.3 כל שינוי או עדכון בתכנים או בשירותים יכול לכלול הוספת קורסים,
            הסרת קורסים קיימים, או עדכון תכנים קיימים.
          </p>
        </section>

        {/* 5. זכויות יוצרים וקניין רוחני */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">
            5. זכויות יוצרים וקניין רוחני
          </h3>
          <p>
            5.1 כל התכנים באתר, לרבות טקסטים, תמונות, גרפיקה, סרטונים, קבצי
            אודיו, עיצובים ועוד, מוגנים בזכויות יוצרים ובזכויות קניין רוחני
            אחרות של העמותה או של צדדים שלישיים.
          </p>
          <p>
            5.2 אין להעתיק, לשכפל, להפיץ, לשדר או להציג כל תוכן מתוך האתר או
            השירותים ללא אישור בכתב מראש מהעמותה או בעלי הזכויות.
          </p>
        </section>

        {/* 6. הסכמה לתנאים */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">6. הסכמה לתנאים</h3>
          <p>
            6.1 כל שימוש באתר או בשירותי העמותה מהווה הסכמה לתנאים המפורטים
            במסמך זה.
          </p>
          <p>
            6.2 העמותה שומרת לעצמה את הזכות לעדכן את תנאי השימוש מעת לעת. כל
            עדכון ייכנס לתוקף מיד לאחר פרסומו באתר, והמשתמש מסכים כי המשך השימוש
            באתר לאחר עדכון התנאים ייחשב כהסכמה לתנאים החדשים.
          </p>
        </section>

        {/* 7. סמכות שיפוט */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">7. סמכות שיפוט</h3>
          <p>7.1 תנאי השימוש כפופים לחוקי מדינת ישראל בלבד.</p>
          <p>
            7.2 כל מחלוקת שתתעורר בנוגע לתנאים אלו, או לשימוש בשירותי העמותה,
            תתברר בפני בית המשפט המוסמך בעיר תל אביב, שיהיה הסמכות השיפוטית
            הבלעדית.
          </p>
        </section>

        {/* 8. סיום השימוש בשירותים */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">
            8. סיום השימוש בשירותים
          </h3>
          <p>
            8.1 העמותה שומרת לעצמה את הזכות להפסיק את השימוש שלך בשירותים בכל
            עת, וזאת אם תפר את תנאי השימוש או תבצע פעולה שנחשבת בעיני העמותה
            להפרת הכללים והמדיניות.
          </p>
          <p>
            8.2 במקרה של הפסקת השימוש, כל הזכויות והחובות של המשתמש לפני הפסקת
            השימוש יישארו בתוקף, והמשתמש לא יוכל לדרוש פיצוי או פיצויים כלשהם
            בגין הפסקת השירותים.
          </p>
        </section>

        {/* 9. פרטיות ואבטחת מידע */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">9. פרטיות ואבטחת מידע</h3>
          <p>
            9.1 העמותה מקפידה על שמירה על פרטיות המידע האישי של המשתמשים
            ומתחייבת לא לעשות שימוש במידע שנמסר אלא לצורכי השירותים המוצעים
            באתר, בכפוף למדיניות הפרטיות של העמותה.
          </p>
          <p>
            9.2 המידע שנמסר על ידי המשתמשים ייאסף וייעשה בו שימוש לצורך מתן
            שירותים לימודיים, ניהול קורסים, תקשורת עם המשתמשים, תשלום (במידה
            ויש), ושירותים נוספים.
          </p>
          <p>
            9.3 העמותה נוקטת אמצעי אבטחה מתקדמים להגן על המידע של המשתמשים, אך
            אינה יכולה להבטיח אבטחה מוחלטת של המידע. המשתמשים מסכימים לכך
            שהעמותה אינה אחראית במקרה של פריצה לאתר או זליגת מידע כתוצאה מכשלים
            טכנולוגיים.
          </p>
        </section>

        {/* 10. שיווק ופרסומות */}
        <section className="mb-6">
          <h3 className="text-lg font-semibold mb-2">10. שיווק ופרסומות</h3>
          <p>
            10.1 העמותה עשויה לשלוח למשתמשים עדכונים אודות קורסים חדשים, סדנאות,
            תכנים נוספים, והטבות באמצעות דיוור ישיר (כגון דוא"ל או הודעות SMS),
            כל עוד המשתמש לא הביע התנגדות לקבלת תקשורת שיווקית.
          </p>
          <p>
            10.2 המשתמש יכול לבחור להסיר את עצמו מרשימת התפוצה בכל עת על ידי
            לחיצה על הקישור המתאים בהודעות או פנייה ישירה לעמותה.
          </p>
        </section>
      </div>

      {/* <form onSubmit={handleSubmit}>
        <div className="flex items-center mb-4">
          <input
            type="checkbox"
            id="accept"
            checked={checked}
            onChange={handleCheckboxChange}
            className="w-4 h-4 ml-2"
          />
          <label htmlFor="accept" className="text-gray-700">
            אני מקבל/ת את תנאי השימוש
          </label>
        </div>
        <button
          type="submit"
          className={`px-6 py-2 rounded-xl text-white font-semibold ${
            checked ? "hover:brightness-90" : "bg-gray-400 cursor-not-allowed"
          }`}
          style={
            checked
              ? { backgroundColor: "#FBD449", color: "#353131" }
              : { color: "#353131" }
          }
          disabled={!checked}
        >
          המשך
        </button>
      </form> */}
    </div>
  );
};

export default TermsOfUse;
